<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"359c2b8e3478b252a3bda796d9a2ea21b2a74d3f9bde8b830cae72fe31045835","plan_job_ref":"Job Test plan target and replace #381 at https://github.com/dflook/terraform-github-actions/actions/runs/7264551037","plan_hash":"673780b4003114ab9c39385192d19d1b642bb580f60e4b4859f30e0592d2fc0c","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "CJLdYKG6Mg" -> (known after apply)
!~  foreach = "2pFYOYDGOK" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #381](https://github.com/dflook/terraform-github-actions/actions/runs/7264551037)